Docs: Replace Mermaid diagram with ASCII Text diagram
